_site/abc214-d-upsolve/index.html
<div id="outline-container-org6bc2247" class="outline-2">
<h2 id="org6bc2247">D - Sum of Maximum Weights</h2>
</div>

<div id="outline-container-org0c8b0ca" class="outline-2">
<h2 id="org0c8b0ca">접근하기</h2>
<div class="outline-text-2" id="text-org0c8b0ca">
<ul class="org-ul">
<li>Union Find에서 연결된 집합의 크기를 count할 수 있어야 함
<ul class="org-ul">
<li>배열을 하나 더 선언해서 count하는 방법</li>
<li>Weighted Union Find를 이용하는 방법</li>
</ul></li>
</ul>

<pre class="example">
3
1 2 10
2 3 20
</pre>

<ul class="org-ul">
<li>f(1,2) = 10</li>
<li>f(2,3) = 20</li>
<li>f(1,3) = 20 : 10 -&gt; 20이면 가장 큰 값을 고름</li>

<li>문제 나온 수학식의 의미 : 모든 쌍을 다 찾아보라</li>
</ul>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N-1) {
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=i+1;j&lt;=N;j++) {
         f(i, j);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6b97a52" class="outline-2">
<h2 id="org6b97a52">코드 - Weighted Union Find를 이용하기</h2>
<div class="outline-text-2" id="text-org6b97a52">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span> {
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">u</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">v</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">w</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;
<span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">pool</span>[200020];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p</span>[200020];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">Find</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span>)
{
    <span style="color: #729fcf; font-weight: bold;">if</span>(p[num] &lt; 0) <span style="color: #729fcf; font-weight: bold;">return</span> num;
    <span style="color: #729fcf; font-weight: bold;">return</span> p[num] = Find(p[num]);
}

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">Union</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">b</span>)
{
    a = Find(a);
    b = Find(b);

    <span style="color: #729fcf; font-weight: bold;">if</span> (a == b) <span style="color: #729fcf; font-weight: bold;">return</span>;

    <span style="color: #729fcf; font-weight: bold;">if</span> (p[a] &lt;= p[b]) {
        p[a] += p[b];    
        p[b] = a;
    } <span style="color: #729fcf; font-weight: bold;">else</span> {
        p[b] += p[a];    
        p[a] = b;
    }
}

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">cmp</span>(<span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">p1</span>, <span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">p2</span>)
{
    <span style="color: #729fcf; font-weight: bold;">return</span> (p1.w &lt; p2.w);
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;=N;i++) p[i] = -1;

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">register</span> <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N-1;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d %d"</span>, &amp;pool[i].u, &amp;pool[i].v, &amp;pool[i].w);
    }
    sort(pool, pool+(N-1), cmp);

    <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #ff6347;">ans</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">register</span> <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N-1;i++) {
        ans += (<span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span>)pool[i].w * p[Find(pool[i].u)] * p[Find(pool[i].v)];
        Union(pool[i].u, pool[i].v);
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%lld\n"</span>, ans);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
} 
</pre>
</div>
</div>
</div>

<div id="outline-container-org962af45" class="outline-2">
<h2 id="org962af45">문제 링크/참고자료</h2>
<div class="outline-text-2" id="text-org962af45">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc214/tasks/abc214_d">https://atcoder.jp/contests/abc214/tasks/abc214_d</a></li>
<li><a href="https://travelbeeee.tistory.com/369">Weighted Union Find</a></li>
</ul>
</div>
</div>
